# coding:utf-8
phone_num = {
    'Afghanistan': ['435365657'],  #阿富汗
    'Albania': ['4273778','4273281'],  #阿尔巴尼亚
    'Algeria': ['554509139'],  #阿尔及利亚
    'Andorra': ['871005','869867'], #安道尔
    'Angola': ['917789778','940471135','929434195'], #安哥拉
    'Argentina': ['2954437535', '2954422693','2234750310','1146742900'], #阿根廷
    'Armenia': ['83112333','56888059'], #亚美尼亚
    'Australia': ['262376500', '262406411'], # 澳大利亚联邦
    'Austria': ['384240627', '384240624'], #奥地利
    'Azerbaijan': ['952950878'], #阿塞拜疆
    'Bahrain': ['17533533','17530483'], #巴林
    'Bangladesh': ['23375181','55139199'], #孟加拉国
    'Belarus': ['172272945','172292206'], #白俄罗斯
    'Belgium': ['22211111','22263083'], #比利时
    'Benin': ['96587492'], #贝宁  +229
    'Bhutan': ['2322381','2313138'], #不丹 +975
    'Bolivia': ['22355546','22317076'],  #玻利维亚 +591
    'Bosnia and Herzegovina': ['33238886'], #波黑 +387
    'Botswana': ['6597810'],  #博茨瓦纳 +267
    'Brasil': ['3298011967', '3194300124'], #巴西 +55
    'Brunei': ['2382888','2380959'], #文莱 +673
    'Bulgaria': ['29865104','29862795'], #保加利亚 +359
    'Burkina Faso': ['20970070'], #布基纳法索 +226
    'Burundi': ['34205618'], #布隆迪共和国 +257
    'Cambodia': ['23723511','23427428'], #柬埔寨 +855
    'Cameroon': ['96612122'], #喀麦隆 +237
    'Canada': ['8678727960', '7809264811'], #加拿大 +1
    'Cape Verde': ['2352200'],#佛得角 +238
    'Central Africa': ['75007700'],  #非洲 +236
    'Chad': ['9368789965','7122682394'], #乍得共和国,真实号码不识别 +235
    'Chile': ['522483600'], #智利 +56
    'China': ['13537208142', '13631868759'], #中国  +86
    'Comoros': ['616753000'], #科摩罗群岛,真实号码不识别  +269
    'Costa Rica': ['2810227','28102251'], #歌斯达黎加,真实号码不识别 +506
    'Croatia': ['17212216','31670286'], #克罗地亚共和国 +385
    'Cuba': ['226456'], #古巴圣地亚哥 +53
    'Cyprus': ['22805745', '22661133'], #塞浦路斯。+357
    'Czech Republic': ['257019511','257217282'], #捷克  +420
    'Democratic Republic of Congo': ['854366031'], #刚果民主共和国 +243
    'Denmark': ['33269049', '33269037'], #丹麦  +45
    'Djibouti': ['54532565'], #吉布提共和国 +253
    'East Timor': ['77772094'],#东帝汶民主共和国 +670
    'Ecuador': ['22569741'], #厄瓜多尔 593
    'Egypt': ['23912356','23923686'], #埃及 20
    'Equatorial Guinea': ['222735785'],#赤道几内亚共和国 240
    'Eritrea': ['01400013'],#厄立特里亚国真实号码400837不识别 291
    'Estonia': ['7375100'],#爱沙尼亚共和国 372
    'Ethiopia': ['0915321896'],#埃塞俄比亚联邦民主共和国 251
    'Fiji': ['3218415','3314996'], #斐济 679
    'Finland': ['0207545129'],#芬兰 358
    'France': ['470027676'],#法国 33
    'Gabon Republic': ['06262039'],#加蓬 241
    'Gambia': ['6894757'],#冈比亚。220
    'Georgia': ['597030730'],#格鲁吉亚。995
    'Germany': ['023139696375'],#德国 49
    'Ghana': ['243212266', '202077427'], #加纳共和国 233
    'Gibraltar': ['20012475'],#直布罗陀。350
    'Greece': ['2105200660', '2105222822', '2105282800'],  #希腊共和国。30
    'Grenada': ['4427310'],#格林纳达。1
    'Guatemala': ['22301579', '22395000'], #危地马拉共和国 502
    'Guinea': ['655913011'],#几内亚。224
    'Guinea-Bissau': ['955974888'],#几内亚比绍 245
    'Haiti': ['28177000'],#海地共和国。509
    'Honduras': ['22342402'],#洪都拉斯。504
    'Hong Kong': ['24989326', '27771540'], #香港 852
    'Hungary': ['76510800', '76320121', '76509906', '76614744'],#匈牙利 36
    'Iceland':['4338000'],#冰岛 353
    'India': ['7552555922', '7690240333', '7552555922'], #印度 91
    'Indonesia': ['82234999777', '471325932', '81241379267', '474321610'],#印度尼西亚共和国 62
    'Iran': ['03132221906'],#伊朗伊斯兰共和国 98
    'Iraq': ['07814400000'],#伊拉克 964
    'Ireland': ['91513200'],#爱尔兰 354
    'Israel': ['86400111'],#以色列 972
    'Italy': ['3357344140'],#意大利 39
    'Ivory Coast': ['31669040'],#科特迪瓦 225
    'Jamaica': ['8769850090'],#牙买加 1
    'Japan': ['339413211', '332027181', '333640251'], #日本 81
    'Jordan': ['6574995'],#牙买加 962
    'Kazakhstan': ['7172791500'],#哈萨克斯坦 7
    'Kenya': ['789300000', '725800820', '728592744'], # 254
    'Kosovo': ['75342424462'],#科索沃 0
    'Kuwait': ['24888000'],#科威特 965
    'Kyrgyzstan': ['372251330'],#吉尔吉斯斯坦 996
    'Laos': ['61312395'],#老挝 856
    'Latvia': ['64860586'],#拉脱维亚 371 
    'Lebanon': ['9934433'],#黎巴嫩 961
    'Lesotho': ['514068220'],#莱索托 266
    'Liberia': ['888600000'],#利比里亚 231
    'Libya': ['923245680'],#利比亚 218
    'Liechtenstein': ['2392020'],#列支敦士登亲王国 423
    'Lithuania': ['42260841'],#立陶宛 370
    'Luxembourg': ['4537851'],#卢森堡 352
    'Macau': ['28828888'],#澳门 853
    'Macedonia': ['75425767'],#马其顿 389
    'Madagascar': ['209552022'],#马达加斯加 261
    'Malawi': ['1776666'],#马拉维 265
    'Malaysia': ['326176273', '341083422', '341616313'], #马来西亚 60
    'Maldives': ['6860028'],#马尔代夫 960
    'Mali Republic': ['76208922'], # 223
    'Malta': ['21441264'],#马耳他 356
    'Mauritania': ['46517465'],#毛里塔尼亚伊斯兰共和国 389
    'Mauritius': ['6705420'],#毛里求斯 230
    'Mexico': ['33141806'], #52
    'Moldova': ['22000000'],#摩尔多瓦 373
    'Monaco': ['93153600'],#摩纳哥亲王国 377
    'Mongolia': ['11325044'],#蒙古 976
    'Montenegro': ['20684000'],#黑山 382
    'Morocco': ['524313047'],#摩洛哥 212
    'Mozambique': ['25220049'],#莫桑比克共和国 258
    'Myanmar': ['67420212'],#缅甸 95
    'Namibia': ['612962929'],#纳米比亚 264
    'Nepal': ['9814308051'],#尼泊尔联邦民主共和国 977
    'Netherlands': ['2055671055'], #31
    'New Zealand':['33659999'],#新西兰 64
    'Niger':['8167191939'],#尼日利亚联邦共和国 // 227
    'Nigeria':['9099777881', '7068151023', '7068151023'], #尼日利亚 234
    'North Korea':['26988112'],#朝鲜 850
    'Norway':['20774398', '20758344'], #挪威王国 //47
    'Oman':['23436421'],#阿曼苏丹国 968
    'Pakistan':['41111222114'],#巴基斯坦伊斯兰共和国 92
    'Palau':['6543598'],#帕劳 680
    'Panama':['9980886'],#巴拿马 507
    'Papua New Guinea': ['3260248', '3211700', '3244704'], #巴布亚新几内亚独立国 675
    'Paraguay':['331241858'],#巴拉圭 595
    'Peru': ['14142700', '12662000', '16605000'], #秘鲁共和国 51
    'Philippines': ['62502222'], #菲律宾 63
    'Poland':['523654620'],#波兰 48
    'Portugal':['256338186'],#葡萄牙 351
    'Qatar':['40274888'],#卡塔尔 974
    'Republic of Colombia': ['14142700', '12662000', '16605000'], #哥伦比亚 57
    'Republic of the Congo':['069879068'],#刚果共和国 242
    'Romania':['350404859'],#罗马尼亚 40
    'Russia':['3912718595'],#俄罗斯联邦 7
    'Rwanda':['783187646'],#卢旺达 250
    'Samoa':['58016'],#萨摩亚 685
    'San Marino':['0549900161'],#圣马力诺 378
    'Sao Tome':['239400400'],# 239
    'Saudi Arabia':['114779523'],#沙特阿拉伯王国，966
    'Senegal':['779396179'],#塞内加尔共和国  221
    'Serbia':['346195046'],#塞尔维亚 381
    'Seychelles':['4325258'],#塞舌尔共和国 248
    'Sierra Leone':['79944444'],#塞拉利昂共和国 232
    'Singapore': ['62502222', '62566011', '62255554'], #新加坡共和国 65
    'Slovakia':['249222455','244373521'], #斯洛伐克 421
    'Slovenia': ['53628100','14767610'], #斯洛文尼亚 386
    'Somalia': ['462202121'],#索马里联邦共和国  252
    'South Africa': ['313363993','119616114','215905718'], #南非 27
    'South Korea': ['536281001', '536641101', '534244114'], #韩国 82
    'South Sudan': ['955257550'],#南苏丹共和国 211
    'Spain': ['912000795', '902888788', '914294085'], #西班牙 1
    'Sri Lanka': ['113047373'],#斯里兰卡 94
    'Sudan': ['183471973'],#苏丹 249
    'Swaziland': ['25058745'],#斯威士兰王国 268
    'Sweden': ['851954800', '107089100', '852023500'], #瑞典王国 46
    'Switzerland': ['31357154'], #瑞士 41
    'Syria': ['937567161'],#阿拉伯叙利亚共和国 963
    'Taiwan': ['423226940', '422270125', '422876867'], #台湾 886
    'Tajikistan': ['988177758'],#塔吉克斯坦 992
    'Tanzania': ['262321641'],#坦桑尼亚联合共和国 255
    'Thailand': ['38251201', '623312063', '884447777'], #泰王国 66
    'Togo':['2267051','2263038'], #多哥,真实号码不识别 228
    'Tunisia':['76211024'],#突尼斯共和国 216
    'Turkey':['2125014000','3123432901'], #土耳其 90
    'Turkmenistan':['12221025'],#土库曼斯坦 993
    'Uganda': ['345678957'],#乌干达共和国 256
    'Ukraine': ['442353381','442440079'], #乌克兰 380
    'United Arab Emirates': ['25053314'],#阿拉伯联合酋长国 971
    'United Kingdom': ['8719846245', '2076384141'],#大不列颠及北爱尔兰联合王国 44
    'United States': ['2126399675', '2126399675', '2123326868'],#美利坚合众国 1
    'Uruguay': ['29160200'], #乌拉圭 598
    'Uzbekistan': ['915235353'],#乌兹别克斯坦共和国 971
    'Vatican City': ['0669890400'],#梵蒂冈城国 39
    'Venezuela': ['2846667633', '2849613204'], #58
    'Vietnam': ['2603863334'],#越南 84
    'Western Sahara': ['528931440'],#西撒哈拉位 212
    'Yemen': ['1507050'],#也门共和国 967
    'Zambia': ['978031800'], #赞比亚共和国 260
    'Zimbabwe': ['775426842', '6822095'],#津巴布韦共和国 263
}
